INSERT INTO subjects (subject_name) VALUES
  ('数学'), ('英語'), ('国語'), ('日本史'), ('物理'), ('化学'), ('プログラミング');

INSERT INTO items (item_id, category, item_name, required_point) VALUES
  ('icon-frame-a', 'アイコンフレーム', 'the betchi', 100),
  ('icon-frame-b', 'アイコンフレーム', 'LOVE', 100),
  ('icon-frame-c', 'アイコンフレーム', '文房具', 100),
  ('catchcopy-a', 'キャッチコピー', '教師超えて強師', 200),
  ('catchcopy-b', 'キャッチコピー', 'ノーベル説明賞受賞', 300),
  ('catchcopy-c', 'キャッチコピー', 'Google検索の下位互換', 100),
  ('effect-a', 'エフェクト', '仮の商品A', 50),
  ('effect-b', 'エフェクト', '仮の商品B', 100),
  ('effect-c', 'エフェクト', '仮の商品C', 200),
  ('stamp-a', 'スタンプ', 'べっちくん（ごめんなさい）', 100),
  ('stamp-b', 'スタンプ', 'べっちくん（ありがとう）', 100),
  ('stamp-c', 'スタンプ', 'べっちくん（喜び）', 100),
  ('stamp-free-a', 'スタンプ', 'べっちくん（はい）', 0),
  ('stamp-free-b', 'スタンプ', 'べっちくん（よろしく）', 0),
  ('stamp-free-c', 'スタンプ', 'べっちくん（了解）', 0),
  ('stamp-free-d', 'スタンプ', 'かとはるです！', 0);


  INSERT INTO subject_topics (subject_id, topic_name) VALUES
  (1, '情報数学'), (1, '線形代数'), (1, 'データサイエンス基礎数理'), (1, '微分積分'), (1, '統計'),
  (2, '英文法'), (2, 'リーディング'), (2, 'リスニング'), (2, '英作文'), (2, 'TOEIC対策'),
  (3, '現代文'), (3, '古文'), (3, '漢文'), (3, 'レポート・論文の書き方'),
  (4, '古代・中世'), (4, '近世'), (4, '近現代'),
  (5, '力学'), (5, '電磁気学'), (5, '熱力学'), (5, '波動'),
  (6, '理論化学'), (6, '無機化学'), (6, '有機化学'),
  (7, 'Web開発'), (7, 'アルゴリズム'), (7, '機械学習'), (7, 'アプリ開発'), (7, 'データベース');
  